# Pandas and Data frames

In [2]:
#importing the required libraries
import numpy as np
import pandas as pd

In [10]:
#Series
s=pd.Series([10,20,30,40,50]) #Series should be in capital , we are calling function series from panadas library , series will give us one column of data frame

In [3]:
s
# my series give me two things the first one is rowname/index and the second thing is column of data frame
# the series by default prints the index nos

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
#Another way - this series is created using arrays
pd.Series(data=[30,40,67,90,100],index=["a","b","c","d","e"]) #we can give indexes as we like

a     30
b     40
c     67
d     90
e    100
dtype: int64

In [3]:
#can we create Series from a dictionary?
s_d = pd.Series({"fi" : 1,"second" : 2, "thi" :3})

In [4]:
s_d

fi        1
second    2
thi       3
dtype: int64

In [5]:
#print the "sec"

s_d["second"]

2

In [6]:
s_d[1]

2

In [9]:
#slicing of the series
s_d[1:2] #by default it will not take the last index

second    2
dtype: int64

In [16]:
#adding the series
s_d + s_d

fi        2
second    4
thi       6
dtype: int64

In [17]:
# numpy oprations
print(np.mean(s_d))
print(np.median(s_d))
print(np.log(s_d))  #to find logarithm

2.0
2.0
fi        0.000000
second    0.693147
thi       1.098612
dtype: float64

In [18]:
# sorting mode...
s_d.sort_values(ascending=False)

thi       3
second    2
fi        1
dtype: int64

In [11]:
#creating dataset for Dataframe - the data set is in 2D array - or nested list 
price=[["SBI", 454],["ONGC",454],["Spicejet",50], ["BOB",110],["RS",130]]

In [12]:
print(price)
print(type(price))

[['SBI', 454], ['ONGC', 454], ['Spicejet', 50], ['BOB', 110], ['RS', 130]]
<class 'list'>

In [13]:
#creating a data frame from price
pd.DataFrame(data=price,)

          0    1
0       SBI  454
1      ONGC  454
2  Spicejet   50
3       BOB  110
4        RS  130

In [14]:
df = pd.DataFrame(data=price,columns=["Company","Price"])
df

    Company  Price
0       SBI    454
1      ONGC    454
2  Spicejet     50
3       BOB    110
4        RS    130

# Indexing in data frame

In [26]:
type(df) #type of dataset/object

pandas.core.frame.DataFrame

In [27]:
df["Price"]
# Tip : name of the var should be exact match with the col names in dataset

0    454
1    454
2     50
3    110
4    130
Name: Price, dtype: int64

In [28]:
df.Price #another way of using price
#this way doesnt work incase the variable name has space

0    454
1    454
2     50
3    110
4    130
Name: Price, dtype: int64

In [31]:
df.Price.mean()

239.6

In [32]:
df.Price.median()

130.0

In [33]:
df.Price.count()

5

In [34]:
df.Price.std()  #standard deviation

197.921196439391

In [35]:
df.Price.describe()

count      5.000000
mean     239.600000
std      197.921196
min       50.000000
25%      110.000000
50%      130.000000
75%      454.000000
max      454.000000
Name: Price, dtype: float64

In [36]:
df.describe()  #describe function evaluate all the statistical paras

            Price
count    5.000000
mean   239.600000
std    197.921196
min     50.000000
25%    110.000000
50%    130.000000
75%    454.000000
max    454.000000

In [38]:
#checking the dimensions of data
df.shape   #shape function is not a callable hence we donot need ()

(5, 2)

In [39]:
df.info()
#object data type means categorical or non numerical data means string based data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
Company    5 non-null object
Price      5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [42]:
#find out the rows of the data where the price >130
df.Price > 130 
    

    
#all the conditional statements in python give answer in true or false ie boolean

0     True
1     True
2    False
3    False
4    False
Name: Price, dtype: bool

In [43]:
#we are passing condition in the index , this is calle conditional indexing
df[df.Price > 130 ]

  Company  Price
0     SBI    454
1    ONGC    454

In [48]:
# we are pulling the company's name for the corr prices
#df[df.Price > 130 ]["Company"] -- both will give the same output
df[df.Price > 130 ].Company

0     SBI
1    ONGC
Name: Company, dtype: object

In [46]:
# the above thing can be done using saving it in the variable first and then printing that variable , both methods are correct
#but creating new variables everytime will occupy some memory
dfgrtrthn130=df[df.Price > 130 ]
dfgrtrthn130

  Company  Price
0     SBI    454
1    ONGC    454

In [47]:
dfgrtrthn130["Company"]
#dfgrtrthn130.Company this will also give te same output

0     SBI
1    ONGC
Name: Company, dtype: object

In [49]:
# here we are trying to pull 2 columns for the given conditional indexing , we will create a list and pass the column names to be pulled in list format ie ["price,"company"] and will pass inside the data frame indexing bracketie []

df[df.Price > 130 ][["Company","Price"]]

  Company  Price
0     SBI    454
1    ONGC    454

In [50]:
df["Delta"] = "True"

In [51]:
df

    Company  Price Delta
0       SBI    454  True
1      ONGC    454  True
2  Spicejet     50  True
3       BOB    110  True
4        RS    130  True

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
Company    5 non-null object
Price      5 non-null int64
Delta      5 non-null object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [54]:
#Deletion can be done by dropping the variable
newdf = df.drop("Delta",axis =1)  #drop function by default works with axis=0 and axis = 0 ,means dropping a record or row but delta is a column name in order to drop that whole column we need to put axis = 1 , in order to drop a column we have put axis =1.
newdf

    Company  Price
0       SBI    454
1      ONGC    454
2  Spicejet     50
3       BOB    110
4        RS    130

In [55]:
df

    Company  Price Delta
0       SBI    454  True
1      ONGC    454  True
2  Spicejet     50  True
3       BOB    110  True
4        RS    130  True

In [56]:
#Dropping last 3 rows 
df[:-3]

  Company  Price Delta
0     SBI    454  True
1    ONGC    454  True

In [57]:
df

    Company  Price Delta
0       SBI    454  True
1      ONGC    454  True
2  Spicejet     50  True
3       BOB    110  True
4        RS    130  True

In [58]:
df.drop(1) #drop row with index 1

    Company  Price Delta
0       SBI    454  True
2  Spicejet     50  True
3       BOB    110  True
4        RS    130  True

In [59]:
df

    Company  Price Delta
0       SBI    454  True
1      ONGC    454  True
2  Spicejet     50  True
3       BOB    110  True
4        RS    130  True

In [62]:
del df["Delta"]

KeyError: 'Delta'

In [63]:
df

    Company  Price
0       SBI    454
1      ONGC    454
2  Spicejet     50
3       BOB    110
4        RS    130

In [15]:
#rename the index
df = df.rename({0:"first",1:"second",2:"third",3:"fourth",4: "fifth"})

In [68]:
df #the functions are not overriting or modifying the tables permanently , hence we have to overrite the df or save df in order to get it saved ie

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50
fourth       BOB    110
fifth         RS    130

In [16]:
df[:3]

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50

In [19]:
df[:3]["Price"].median()

454.0

In [71]:
df

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50
fourth       BOB    110
fifth         RS    130

# iloc and loc

In [72]:
#iloc is integer based location
#loc -location

#take the df and pull the first row of the data
# Tip -df.iloc pulls the data from rowside
#obs - loc takes labels to pull the data and needs slicing operator as well
#whereas iloc only goes well with the integer value as indexing

df.iloc[1] # int based location indexing , it will return first row ie 1 index row

Company    ONGC
Price       454
Name: second, dtype: object

In [75]:
df.loc[:, "Company"]

first          SBI
second        ONGC
third     Spicejet
fourth         BOB
fifth           RS
Name: Company, dtype: object

In [79]:
df.loc["second"]

Company    ONGC
Price       454
Name: second, dtype: object

In [80]:
df.iloc[-1] #it will give last row

Company     RS
Price      130
Name: fifth, dtype: object

In [82]:
df.iloc[0:-1,1] #it will give first column and all rows
#[0:-1 --> this is row entry , since we  are giving all we are starting from 0 to last row ,1--> it will print 1st column] ie [row,column]
#df.iloc[:,1] this will also give the same output as above

first     454
second    454
third      50
fourth    110
Name: Price, dtype: int64

In [83]:
df.iloc[:,:]

# : means whole rows and whole columns

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50
fourth       BOB    110
fifth         RS    130

In [85]:
df.iloc[1:3,:]

         Company  Price
second      ONGC    454
third   Spicejet     50

In [91]:
#example of selecting multiple rows and columns
df.iloc[[1,3],:1]   #indexing starts with 0 to n-1 , we are returning second and 4th row with 1st column

       Company
second    ONGC
fourth     BOB

In [87]:
df

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50
fourth       BOB    110
fifth         RS    130

In [88]:
df.iloc[:,0]

first          SBI
second        ONGC
third     Spicejet
fourth         BOB
fifth           RS
Name: Company, dtype: object

In [89]:
df.iloc[:,:0]

Empty DataFrame
Columns: []
Index: [first, second, third, fourth, fifth]

In [90]:
df.iloc[:,0:]

         Company  Price
first        SBI    454
second      ONGC    454
third   Spicejet     50
fourth       BOB    110
fifth         RS    130

In [94]:
#loc - will take labels
df.loc[["first","fourth"],"Price"]

first     454
fourth    110
Name: Price, dtype: int64

In [98]:
#pull row where price is 110
df[df.Price ==110]

       Company  Price
fourth     BOB    110

In [99]:
#pull company names where price is 454
df[df.Price ==454]["Company"]

first      SBI
second    ONGC
Name: Company, dtype: object

In [20]:
#Data frame 2
data = pd.DataFrame({"price": [95,25,85,41,78],
                     "ticker": ["AXP","CSO","DIS","MSFT","WMT"],
                     "Company":["AMEX","Cisco","Walt Disney","Microsoft","Walmart"]
                    })
data

   price ticker      Company
0     95    AXP         AMEX
1     25    CSO        Cisco
2     85    DIS  Walt Disney
3     41   MSFT    Microsoft
4     78    WMT      Walmart

In [103]:
data.iloc[[0,2],1:3]

  ticker      Company
0    AXP         AMEX
2    DIS  Walt Disney

In [105]:
data.iloc[0:4]

   price ticker      Company
0     95    AXP         AMEX
1     25    CSO        Cisco
2     85    DIS  Walt Disney
3     41   MSFT    Microsoft

In [122]:

data["Year"]=2019

In [124]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
price      5 non-null int64
ticker     5 non-null object
Company    5 non-null object
Year       5 non-null int64
dtypes: int64(2), object(2)
memory usage: 240.0+ bytes

In [125]:
data

   price ticker      Company  Year
0     95    AXP         AMEX  2019
1     25    CSO        Cisco  2019
2     85    DIS  Walt Disney  2019
3     41   MSFT    Microsoft  2019
4     78    WMT      Walmart  2019

In [127]:
data["price_disc"]=data.price*(90/100)
data

   price ticker      Company  Year  price_disc
0     95    AXP         AMEX  2019        85.5
1     25    CSO        Cisco  2019        22.5
2     85    DIS  Walt Disney  2019        76.5
3     41   MSFT    Microsoft  2019        36.9
4     78    WMT      Walmart  2019        70.2

# Missing values

In [21]:
d=({"A":[1,2,np.nan],"B":[2,np.nan,np.nan],"C":[1,2,3]})
#nan stands for not a number

In [129]:
d

{'A': [1, 2, nan], 'B': [2, nan, nan], 'C': [1, 2, 3]}

In [131]:
miss = pd.DataFrame(d)
miss

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [132]:
#Drop the missing values
miss.dropna()  # it will drop all the rows where there is na values

     A    B  C
0  1.0  2.0  1

In [133]:
miss.dropna(axis=1)  # it will drop all the columns where there is na values

   C
0  1
1  2
2  3

In [134]:
#understandin the concept of threshold
miss.dropna(thresh=2)  
#atleast keep those rows or data point where there are  elements present

     A    B  C
0  1.0  2.0  1
1  2.0  NaN  2

In [135]:
#dropna will drop na values and fillna will fill na values
miss.A.median()

1.5

In [136]:
miss.fillna(value=miss.A.median())

     A    B  C
0  1.0  2.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Group by

In [22]:
dataset={"Company":["Google","Google","MSFT","MSFT","FB","FB"],
        "Person" :["Charlie","Abbey","Duncans","Daniels","Steve","Burnett"],
        "Sales": [200,120,340,124,243,350]}

In [23]:
df=pd.DataFrame(dataset)

In [24]:
df

  Company   Person  Sales
0  Google  Charlie    200
1  Google    Abbey    120
2    MSFT  Duncans    340
3    MSFT  Daniels    124
4      FB    Steve    243
5      FB  Burnett    350

In [25]:
#finnd the sales of all the companies
grouping=df.groupby(by="Company")

In [26]:
grouping

In [149]:
print(grouping.sum())
print(grouping.mean())
print(grouping.max())
print(grouping.median())

         Sales
Company
FB         593
Google     320
MSFT       464
         Sales
Company
FB       296.5
Google   160.0
MSFT     232.0
          Person  Sales
Company
FB         Steve    350
Google   Charlie    200
MSFT     Duncans    340
         Sales
Company
FB       296.5
Google   160.0
MSFT     232.0

In [151]:
#give the median sales of FB
grouping.median().loc["FB"]

Sales    296.5
Name: FB, dtype: float64

In [152]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [153]:
grouping.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [154]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [155]:
#finding the desc stats of google through groupby
df.groupby("Company").describe().loc["Google"]

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Google, dtype: float64

In [158]:
#find the entries of Google

df[df.Company=="Google"]

  Company   Person  Sales
0  Google  Charlie    200
1  Google    Abbey    120

In [159]:
#filter the sales greater than 200
df[df.Sales>200]

  Company   Person  Sales
2    MSFT  Duncans    340
4      FB    Steve    243
5      FB  Burnett    350

In [160]:
#find the sales of Daniels
df[df.Person=="Daniels"]["Sales"]

3    124
Name: Sales, dtype: int64

Sales    320
Name: Google, dtype: int64

In [177]:
df[df.Person=="Daniels"].iloc[:,[0,2]]

  Company  Sales
3    MSFT    124

In [178]:
df[df.Person=="Daniels"][["Company","Sales"]]

  Company  Sales
3    MSFT    124

In [180]:
df[df.Person=="Daniels"].loc[:,["Company","Sales"]]

  Company  Sales
3    MSFT    124

In [181]:
#sort the data frme basis the sales
df.sort_values(by="Sales")

  Company   Person  Sales
1  Google    Abbey    120
3    MSFT  Daniels    124
0  Google  Charlie    200
4      FB    Steve    243
2    MSFT  Duncans    340
5      FB  Burnett    350

In [182]:
df.sort_values(by="Sales", ascending=False)

  Company   Person  Sales
5      FB  Burnett    350
2    MSFT  Duncans    340
4      FB    Steve    243
0  Google  Charlie    200
3    MSFT  Daniels    124
1  Google    Abbey    120

In [186]:
#ascending order by person and company
df.sort_values(by=["Company", "Person"]) 
#whenever there are multiple things make a list

  Company   Person  Sales
5      FB  Burnett    350
4      FB    Steve    243
1  Google    Abbey    120
0  Google  Charlie    200
3    MSFT  Daniels    124
2    MSFT  Duncans    340